_posts/productivity/2014-03-17-update-field-when-open.html
---
layout: post
title: 打開 M$ Word 文檔的時候自動更新域
categories: [productivity]
tags: [MS office]
---

<p>
今天編輯設計文檔的時候，每次更新了文檔標題信息后要選中標題域（Field）點擊更新才可以更新到最新的字符。Google 了一下發現一個 VBS 腳本<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>可以做到每次打開文檔的時候自動把文檔内的域更新。
</p>

<div class="org-src-container">

<pre class="src src-vb">Sub AutoOpen()
    '
    ' AutoOpen Macro
    '
    '
    Dim aStory As Range
    Dim aField As Field

    ' Check that document is not in Protected View before doing anything
    If Application.ActiveProtectedViewWindow Is Nothing Then

           For Each aStory In ActiveDocument.StoryRanges

              For Each aField In aStory.Fields
                 aField.Update
              Next aField

           Next aStory

         ' set document as unchanged (prevents save dialog popping up when
         'closing) - further changes will set this back
         ActiveDocument.Saved = True
    End If
End Sub
</pre>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
<a href="http://superuser.com/questions/458595/word-2010-template-with-automatically-updated-fields">http://superuser.com/questions/458595/word-2010-template-with-automatically-updated-fields</a>
</p></div>


</div>
</div>
